packages/django-cfdi/django_cfdi-1.7.34-py3-none-any.whl/cfdi/xslt/TimbradoService.WSDL

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.2.0-1 (tags/2.2.0u1-7139; 2012-06-02T10:55:19+0000) JAXWS-RI/2.2.6-2 JAXWS/2.2 svn-revision#unknown. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is Metro/2.2.0-1 (tags/2.2.0u1-7139; 2012-06-02T10:55:19+0000) JAXWS-RI/2.2.6-2 JAXWS/2.2 svn-revision#unknown. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="timbrado.ws.pade.mx" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="timbrado.ws.pade.mx" name="TimbradoService">
<types>
<xsd:schema>
<xsd:import namespace="timbrado.ws.pade.mx" schemaLocation="https://www.pade.mx/PadeApp/TimbradoService?xsd=1"/>
</xsd:schema>
</types>
<message name="status">
<part name="parameters" element="tns:status"/>
</message>
<message name="statusResponse">
<part name="parameters" element="tns:statusResponse"/>
</message>
<message name="timbrado">
<part name="parameters" element="tns:timbrado"/>
</message>
<message name="timbradoResponse">
<part name="parameters" element="tns:timbradoResponse"/>
</message>
<message name="cancelar">
<part name="parameters" element="tns:cancelar"/>
</message>
<message name="cancelarResponse">
<part name="parameters" element="tns:cancelarResponse"/>
</message>
<message name="timbradoPrueba">
<part name="parameters" element="tns:timbradoPrueba"/>
</message>
<message name="timbradoPruebaResponse">
<part name="parameters" element="tns:timbradoPruebaResponse"/>
</message>
<message name="cfdiPorUUID">
<part name="parameters" element="tns:cfdiPorUUID"/>
</message>
<message name="cfdiPorUUIDResponse">
<part name="parameters" element="tns:cfdiPorUUIDResponse"/>
</message>
<message name="acuseRecibo">
<part name="parameters" element="tns:acuseRecibo"/>
</message>
<message name="acuseReciboResponse">
<part name="parameters" element="tns:acuseReciboResponse"/>
</message>
<message name="acuseCancelacion">
<part name="parameters" element="tns:acuseCancelacion"/>
</message>
<message name="acuseCancelacionResponse">
<part name="parameters" element="tns:acuseCancelacionResponse"/>
</message>
<message name="cancelarConOpciones">
<part name="parameters" element="tns:cancelarConOpciones"/>
</message>
<message name="cancelarConOpcionesResponse">
<part name="parameters" element="tns:cancelarConOpcionesResponse"/>
</message>
<message name="timbradoConOpciones">
<part name="parameters" element="tns:timbradoConOpciones"/>
</message>
<message name="timbradoConOpcionesResponse">
<part name="parameters" element="tns:timbradoConOpcionesResponse"/>
</message>
<message name="timbradoPruebaConOpciones">
<part name="parameters" element="tns:timbradoPruebaConOpciones"/>
</message>
<message name="timbradoPruebaConOpcionesResponse">
<part name="parameters" element="tns:timbradoPruebaConOpcionesResponse"/>
</message>
<portType name="Timbrado">
<operation name="status">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/statusRequest" message="tns:status"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/statusResponse" message="tns:statusResponse"/>
</operation>
<operation name="timbrado">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoRequest" message="tns:timbrado"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoResponse" message="tns:timbradoResponse"/>
</operation>
<operation name="cancelar">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/cancelarRequest" message="tns:cancelar"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/cancelarResponse" message="tns:cancelarResponse"/>
</operation>
<operation name="timbradoPrueba">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoPruebaRequest" message="tns:timbradoPrueba"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoPruebaResponse" message="tns:timbradoPruebaResponse"/>
</operation>
<operation name="cfdiPorUUID">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/cfdiPorUUIDRequest" message="tns:cfdiPorUUID"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/cfdiPorUUIDResponse" message="tns:cfdiPorUUIDResponse"/>
</operation>
<operation name="acuseRecibo">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/acuseReciboRequest" message="tns:acuseRecibo"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/acuseReciboResponse" message="tns:acuseReciboResponse"/>
</operation>
<operation name="acuseCancelacion">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/acuseCancelacionRequest" message="tns:acuseCancelacion"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/acuseCancelacionResponse" message="tns:acuseCancelacionResponse"/>
</operation>
<operation name="cancelarConOpciones">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/cancelarConOpcionesRequest" message="tns:cancelarConOpciones"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/cancelarConOpcionesResponse" message="tns:cancelarConOpcionesResponse"/>
</operation>
<operation name="timbradoConOpciones">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoConOpcionesRequest" message="tns:timbradoConOpciones"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoConOpcionesResponse" message="tns:timbradoConOpcionesResponse"/>
</operation>
<operation name="timbradoPruebaConOpciones">
<input wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoPruebaConOpcionesRequest" message="tns:timbradoPruebaConOpciones"/>
<output wsam:Action="timbrado.ws.pade.mx/Timbrado/timbradoPruebaConOpcionesResponse" message="tns:timbradoPruebaConOpcionesResponse"/>
</operation>
</portType>
<binding name="TimbradoPortBinding" type="tns:Timbrado">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
<operation name="status">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="timbrado">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="cancelar">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="timbradoPrueba">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="cfdiPorUUID">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="acuseRecibo">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="acuseCancelacion">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="cancelarConOpciones">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="timbradoConOpciones">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
<operation name="timbradoPruebaConOpciones">
<soap:operation soapAction=""/>
<input>
<soap:body use="literal"/>
</input>
<output>
<soap:body use="literal"/>
</output>
</operation>
</binding>
<service name="TimbradoService">
<port name="TimbradoPort" binding="tns:TimbradoPortBinding">
<soap:address location="https://www.pade.mx/PadeApp/TimbradoService"/>
</port>
</service>
</definitions>